RIOT-OS/RIOT/cpu/cc26xx_cc13xx/vendor/ti/devices/cc26x0/driverlib/aon_event.h
//*****************************************************************************
//
//! \brief Get source for the specified programmable event forwarded to the MCU event
//! fabric.
//!
//! The AON event fabric has a total of three programmable events that can
//! be forwarded to the MCU event fabric.
//!
//! \param ui32MCUEvent is one of three programmable events forwarded to the
//! MCU event fabric.
//! - \ref AON_EVENT_MCU_EVENT0
//! - \ref AON_EVENT_MCU_EVENT1
//! - \ref AON_EVENT_MCU_EVENT2
//!
//! \return Returns the event source for the event AON fabric.
//! - AON_EVENT_DIO0                   : Edge detect on DIO0. See hw_device.h
//! - ...
//! - AON_EVENT_DIO31                  : Edge detect on DIO31. See hw_device.h
//! - \ref AON_EVENT_IO                : Edge detect on any DIO. Edge detect is enabled and configured in IOC.
//! - \ref AON_EVENT_RTC_CH0           : RTC channel 0
//! - \ref AON_EVENT_RTC_CH1           : RTC channel 1
//! - \ref AON_EVENT_RTC_CH2           : RTC channel 2
//! - \ref AON_EVENT_RTC_CH0_DLY       : RTC channel 0 - delayed event
//! - \ref AON_EVENT_RTC_CH1_DLY       : RTC channel 1 - delayed event
//! - \ref AON_EVENT_RTC_CH2_DLY       : RTC channel 2 - delayed event
//! - \ref AON_EVENT_RTC_COMB_DLY      : RTC combined delayed event
//! - \ref AON_EVENT_RTC_UPD           : RTC Update Tick (16 kHz signal, i.e. event line toggles value every 32 kHz clock period)
//! - \ref AON_EVENT_JTAG              : JTAG generated event
//! - \ref AON_EVENT_AUX_SWEV0         : AUX Software triggered event #0
//! - \ref AON_EVENT_AUX_SWEV1         : AUX Software triggered event #1
//! - \ref AON_EVENT_AUX_SWEV2         : AUX Software triggered event #2
//! - \ref AON_EVENT_AUX_COMPA         : Comparator A triggered (synchronized in AUX)
//! - \ref AON_EVENT_AUX_COMPB         : Comparator B triggered (synchronized in AUX)
//! - \ref AON_EVENT_AUX_ADC_DONE      : ADC conversion completed
//! - \ref AON_EVENT_AUX_TDC_DONE      : TDC completed or timed out
//! - \ref AON_EVENT_AUX_TIMER0_EV     : Timer 0 event
//! - \ref AON_EVENT_AUX_TIMER1_EV     : Timer 1 event
//! - \ref AON_EVENT_BATMON_TEMP       : BATMON temperature update event
//! - \ref AON_EVENT_BATMON_VOLT       : BATMON voltage update event
//! - \ref AON_EVENT_AUX_COMPB_ASYNC   : Comparator B triggered. Asynchronous signal directly from the AUX Comparator B
//! - \ref AON_EVENT_AUX_COMPB_ASYNC_N : Comparator B not triggered. Asynchronous signal directly from the AUX Comparator B
//! - \ref AON_EVENT_NONE              : No event, always low
//!
//! \sa AONEventMcuSet()
//
//*****************************************************************************
extern uint32_t AONEventMcuGet(uint32_t ui32MCUEvent);

//*****************************************************************************
//
//! \brief Select event source forwarded to AON Real Time Clock (RTC).
//!
//! A programmable event can be forwarded to the AON real time clock
//! for triggering a capture event on RTC channel 1.
//!
//! \param ui32EventSrc is an event source for the event AON fabric.
//! - AON_EVENT_DIO0                   : Edge detect on DIO0. See hw_device.h
//! - ...
//! - AON_EVENT_DIO31                  : Edge detect on DIO31. See hw_device.h
//! - \ref AON_EVENT_IO                : Edge detect on any DIO. Edge detect is enabled and configured in IOC.
//! - \ref AON_EVENT_RTC_CH0           : RTC channel 0
//! - \ref AON_EVENT_RTC_CH1           : RTC channel 1
//! - \ref AON_EVENT_RTC_CH2           : RTC channel 2
//! - \ref AON_EVENT_RTC_CH0_DLY       : RTC channel 0 - delayed event
//! - \ref AON_EVENT_RTC_CH1_DLY       : RTC channel 1 - delayed event
//! - \ref AON_EVENT_RTC_CH2_DLY       : RTC channel 2 - delayed event
//! - \ref AON_EVENT_RTC_COMB_DLY      : RTC combined delayed event
//! - \ref AON_EVENT_RTC_UPD           : RTC Update Tick (16 kHz signal, i.e. event line toggles value every 32 kHz clock period)
//! - \ref AON_EVENT_JTAG              : JTAG generated event
//! - \ref AON_EVENT_AUX_SWEV0         : AUX Software triggered event #0
//! - \ref AON_EVENT_AUX_SWEV1         : AUX Software triggered event #1
//! - \ref AON_EVENT_AUX_SWEV2         : AUX Software triggered event #2
//! - \ref AON_EVENT_AUX_COMPA         : Comparator A triggered (synchronized in AUX)
//! - \ref AON_EVENT_AUX_COMPB         : Comparator B triggered (synchronized in AUX)
//! - \ref AON_EVENT_AUX_ADC_DONE      : ADC conversion completed
//! - \ref AON_EVENT_AUX_TDC_DONE      : TDC completed or timed out
//! - \ref AON_EVENT_AUX_TIMER0_EV     : Timer 0 event
//! - \ref AON_EVENT_AUX_TIMER1_EV     : Timer 1 event
//! - \ref AON_EVENT_BATMON_TEMP       : BATMON temperature update event
//! - \ref AON_EVENT_BATMON_VOLT       : BATMON voltage update event
//! - \ref AON_EVENT_AUX_COMPB_ASYNC   : Comparator B triggered. Asynchronous signal directly from the AUX Comparator B
//! - \ref AON_EVENT_AUX_COMPB_ASYNC_N : Comparator B not triggered. Asynchronous signal directly from the AUX Comparator B
//! - \ref AON_EVENT_NONE              : No event, always low
//!
//! \return None
//!
//! \sa AONEventRtcGet()
//
//*****************************************************************************
__STATIC_INLINE void
AONEventRtcSet(uint32_t ui32EventSrc)
{
    uint32_t ui32Ctrl;

    // Check the arguments.
    ASSERT(ui32EventSrc <= AON_EVENT_NONE);

    ui32Ctrl = HWREG(AON_EVENT_BASE + AON_EVENT_O_RTCSEL);
    ui32Ctrl &= ~(AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_M);
    ui32Ctrl |= (ui32EventSrc & 0x3f) << AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_S;

    HWREG(AON_EVENT_BASE + AON_EVENT_O_RTCSEL) = ui32Ctrl;
}

//*****************************************************************************
//
//! \brief Get event source forwarded to AON Real Time Clock (RTC).
//!
//! A programmable event can be forwarded to the AON real time clock
//! for triggering a capture event on RTC channel 1.
//!
//! \return Returns the event source to the event AON fabric.
//! - AON_EVENT_DIO0                   : Edge detect on DIO0. See hw_device.h
//! - ...
//! - AON_EVENT_DIO31                  : Edge detect on DIO31. See hw_device.h
//! - \ref AON_EVENT_IO                : Edge detect on any DIO. Edge detect is enabled and configured in IOC.
//! - \ref AON_EVENT_RTC_CH0           : RTC channel 0
//! - \ref AON_EVENT_RTC_CH1           : RTC channel 1
//! - \ref AON_EVENT_RTC_CH2           : RTC channel 2
//! - \ref AON_EVENT_RTC_CH0_DLY       : RTC channel 0 - delayed event
//! - \ref AON_EVENT_RTC_CH1_DLY       : RTC channel 1 - delayed event
//! - \ref AON_EVENT_RTC_CH2_DLY       : RTC channel 2 - delayed event
//! - \ref AON_EVENT_RTC_COMB_DLY      : RTC combined delayed event
//! - \ref AON_EVENT_RTC_UPD           : RTC Update Tick (16 kHz signal, i.e. event line toggles value every 32 kHz clock period)
//! - \ref AON_EVENT_JTAG              : JTAG generated event
//! - \ref AON_EVENT_AUX_SWEV0         : AUX Software triggered event #0
//! - \ref AON_EVENT_AUX_SWEV1         : AUX Software triggered event #1
//! - \ref AON_EVENT_AUX_SWEV2         : AUX Software triggered event #2
//! - \ref AON_EVENT_AUX_COMPA         : Comparator A triggered (synchronized in AUX)
//! - \ref AON_EVENT_AUX_COMPB         : Comparator B triggered (synchronized in AUX)
//! - \ref AON_EVENT_AUX_ADC_DONE      : ADC conversion completed
//! - \ref AON_EVENT_AUX_TDC_DONE      : TDC completed or timed out
//! - \ref AON_EVENT_AUX_TIMER0_EV     : Timer 0 event
//! - \ref AON_EVENT_AUX_TIMER1_EV     : Timer 1 event
//! - \ref AON_EVENT_BATMON_TEMP       : BATMON temperature update event
//! - \ref AON_EVENT_BATMON_VOLT       : BATMON voltage update event
//! - \ref AON_EVENT_AUX_COMPB_ASYNC   : Comparator B triggered. Asynchronous signal directly from the AUX Comparator B
//! - \ref AON_EVENT_AUX_COMPB_ASYNC_N : Comparator B not triggered. Asynchronous signal directly from the AUX Comparator B
//! - \ref AON_EVENT_NONE              : No event, always low
//!
//! \sa AONEventRtcSet()
//
//*****************************************************************************
__STATIC_INLINE uint32_t
AONEventRtcGet(void)
{
    uint32_t ui32EventSrc;

    // Return the active event.
    ui32EventSrc = HWREG(AON_EVENT_BASE + AON_EVENT_O_RTCSEL);

    return ((ui32EventSrc & AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_M) >>
            AON_EVENT_RTCSEL_RTC_CH1_CAPT_EV_S);
}

//*****************************************************************************
//
// Support for DriverLib in ROM:
// Redirect to implementation in ROM when available.
//
//*****************************************************************************
#if !defined(DRIVERLIB_NOROM) && !defined(DOXYGEN)
    #include "../driverlib/rom.h"
    #ifdef ROM_AONEventMcuWakeUpSet
        #undef  AONEventMcuWakeUpSet
        #define AONEventMcuWakeUpSet            ROM_AONEventMcuWakeUpSet
    #endif
    #ifdef ROM_AONEventMcuWakeUpGet
        #undef  AONEventMcuWakeUpGet
        #define AONEventMcuWakeUpGet            ROM_AONEventMcuWakeUpGet
    #endif
    #ifdef ROM_AONEventAuxWakeUpSet
        #undef  AONEventAuxWakeUpSet
        #define AONEventAuxWakeUpSet            ROM_AONEventAuxWakeUpSet
    #endif
    #ifdef ROM_AONEventAuxWakeUpGet
        #undef  AONEventAuxWakeUpGet
        #define AONEventAuxWakeUpGet            ROM_AONEventAuxWakeUpGet
    #endif
    #ifdef ROM_AONEventMcuSet
        #undef  AONEventMcuSet
        #define AONEventMcuSet                  ROM_AONEventMcuSet
    #endif
    #ifdef ROM_AONEventMcuGet
        #undef  AONEventMcuGet
        #define AONEventMcuGet                  ROM_AONEventMcuGet
    #endif
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif //  __AON_EVENT_H__

//*****************************************************************************
//
//! Close the Doxygen group.
//! @}
//! @}
//
//*****************************************************************************
